app/controllers/simple_pages_controller.rb

  def landing_page
    @featured_product = Product.first
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ?  [["LIMIT", 3]]